In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
df = pd.read_csv('PricingData - PricingData.csv')

In [6]:
df.head()

,Seat Fare Type 1,Seat Fare Type 2,Bus,Service Date,RecordedAt
0,"900.00,800.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,11-07-2020 16:28
1,"910.00,833.00,795.00,762.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,11-07-2020 19:17
2,"910.00,833.00,795.00,762.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,12-07-2020 09:02
3,"910.00,833.00,795.00,762.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,12-07-2020 10:05
4,"876.00,800.00,767.00,729.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,13-07-2020 01:53

In [12]:
# df['Service Date'] = df['Service Date'].to_datetime
df['Service Date'] =  pd.to_datetime(df['Service Date'] ,)

In [13]:
df['RecordedAt'] = pd.to_datetime(df['RecordedAt'])

In [15]:
len(df['Bus'].unique())

117

In [23]:
df['Seat Fare Type 1'] = df['Seat Fare Type 1'].astype('string')
df['Seat Fare Type 2'] = df['Seat Fare Type 2'].astype('string')
df['Bus'] = df['Bus'].astype('string')

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30649 entries, 0 to 30648
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Seat Fare Type 1  30649 non-null  string
 1   Seat Fare Type 2  30649 non-null  string
 2   Bus               30649 non-null  string
 3   Service Date      30649 non-null  datetime64[ns]
 4   RecordedAt        30649 non-null  datetime64[ns]
dtypes: datetime64[ns](2), string(3)
memory usage: 1.2 MB

In [28]:
df.tail()

,Seat Fare Type 1,Seat Fare Type 2,Bus,Service Date,RecordedAt
30644,0 90...,0 NaN 1 ...,0 d6fa79179fda2a77455794637f225962 1 ...,2020-07-30,2020-07-30 07:59:00
30645,0 90...,0 NaN 1 ...,0 d6fa79179fda2a77455794637f225962 1 ...,2020-07-30,2020-07-30 07:59:00
30646,0 90...,0 NaN 1 ...,0 d6fa79179fda2a77455794637f225962 1 ...,2020-07-30,2020-07-30 08:08:00
30647,0 90...,0 NaN 1 ...,0 d6fa79179fda2a77455794637f225962 1 ...,2020-07-30,2020-07-30 08:21:00
30648,0 90...,0 NaN 1 ...,0 d6fa79179fda2a77455794637f225962 1 ...,2020-07-30,2020-07-30 08:21:00